.onAttach <- function(libname, pkgname) {
  ver <- utils::packageVersion(pkgname)
  banner <- paste0(
"
                                               ░██               ░██
                                               ░██
 ░████████  ░████████ ░████████   ░███████  ░████████ ░██    ░██ ░██ ░███████  ░██    ░██    ░██
░██    ░██ ░██    ░██ ░██    ░██ ░██    ░██    ░██    ░██    ░██ ░██░██    ░██ ░██    ░██    ░██
░██    ░██ ░██    ░██ ░██    ░██ ░█████████    ░██     ░██  ░██  ░██░█████████  ░██  ░████  ░██
░██   ░███ ░██   ░███ ░██    ░██ ░██           ░██      ░██░██   ░██░██          ░██░██ ░██░██
 ░█████░██  ░█████░██ ░██    ░██  ░███████      ░████    ░███    ░██ ░███████     ░███   ░███
       ░██        ░██
 ░███████   ░███████


ggNetView: Reproducible and Deterministic Network Analysis and Visualization
Version: ", ver, "

  Authors:     Yue Liu, Chao Wang
  Maintainer:  Yue Liu <yueliu@iae.ac.cn>

  Manual:      https://jiawang1209.github.io/ggNetView-manual/
  GitHub:      https://github.com/Jiawang1209/ggNetView
  Bug Reports: https://github.com/Jiawang1209/ggNetView/issues

  Type citation('ggNetView') for how to cite this package.
"
  )
  packageStartupMessage(banner)
}
